cavisson/default/default/scripts/Debug_AWS/CertEnrollTibco.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:v1='http://schemas.gamestop.com/shared/commonschemas/v1.0' xmlns:v11='http://schemas.gamestop.com/marketing/loyaltylifecycle/loyaltymembershipservice/messagetypes/v1.0'>
  <soapenv:Header>
    <v1:MessageHeaders>
      <MachineName>USGVL9QNFSY1</MachineName>
      <KeyValuePairs>
        <KeyValuePair>
          <Key>channeltype</Key>
          <Value>PointOfSale</Value>
        </KeyValuePair>
        <KeyValuePair>
          <Key>storenumber</Key>
          <Value>480</Value>
        </KeyValuePair>
      </KeyValuePairs>
      <CultureInfo>
        <Locale>en-US</Locale>
        <TimeZone>CST</TimeZone>
        <CountryCode>US</CountryCode>
      </CultureInfo>
    </v1:MessageHeaders>
  </soapenv:Header>
  <soapenv:Body>
    <v11:EnrollCustomerForMembershipRequest>
      <v11:Customer>
        <Addresses>
          <Address>
            <AddressLine1>62451 Westport Pkwy</AddressLine1>
            <AddressLine2/>
            <AddressType>Home</AddressType>
            <City>Grapevine</City>
            <Country>US</Country>
            <FirstName>ECPProTestFirst</FirstName>
            <IsDefault>true</IsDefault>
            <LastName>ECPProTestLast</LastName>
            <PostalCode>76051</PostalCode>
            <StateOrProvince>TX</StateOrProvince>
          </Address>
      </Addresses>
        <EmailAddress>prervnates1234990@gmail.com</EmailAddress>
        <FirstName>Drewa</FirstName>
        <Phones>
          <Phone>
            <HomePhoneNumber>5105887500</HomePhoneNumber>
            <PrimaryPhone>Home</PrimaryPhone>
          </Phone>
        </Phones>
        <LastName>Lindsay</LastName>
        <LoyaltyInfo>
          <IsLockedOut>false</IsLockedOut>
          <LoginTimeStamp>2019-03-21T14:56:32.0000000-06:00</LoginTimeStamp>
          <LoyaltyCardNumber>3879594432384</LoyaltyCardNumber>
          <Tier>3876</Tier>
          <TierExpirationDate>2020-03-21T14:56:32.0000000-06:00</TierExpirationDate>
          <TierSignUpDate>2019-03-21T14:56:32.0000000-06:00</TierSignUpDate>
        </LoyaltyInfo>
      </v11:Customer>
    </v11:EnrollCustomerForMembershipRequest>
  </soapenv:Body>
</soapenv:Envelope>